// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19, 6, 1, 33 -> [1, 2, 5, 7, 19, 6, 1, 33]

//Аналогично задаче 30
//Выбрать любой диапазон, лучше если универсальный метод, позволяющий зада0вать диапазон массива, 
//еще лучше если позволяет диапазон данных для генерации чисел (мин и макс, например)
//и отдельный метод которы будет выводить в консоль наш результат- массив..
// Нужно создать метод PrintArray который через цикл будет выводить наши элементы 